from modelInfo.model_info_show import model_info_show

def get_model_info_decision_tree():
    model_name = "Decision Tree"
    description = [
        "Дървото на решенията е алгоритъм за контролирано обучение, използван както за задачи по класификация, така и за регресия. "
        "То има йерархична дървовидна структура, която се състои от коренен възел, клонове, вътрешни възли и листни възли. "
        "Дървото на решенията разделя набора от данни въз основа на стойностите на характеристиките, за да създаде чисти подмножества. "
        "В идеалния случай всички елементи в групата принадлежат към един и същи клас. "
        "Всеки листен възел на дървото съответства на етикет на клас, а вътрешните възли са точки на вземане на решения, базирани на характеристики. "
    ]

    image_name = "decision_tree"

    strengths = [
        "Лесен за разбиране и интерпретиране.",
        "Може да моделира нелинейни зависимости.",
        "Работи добре с различни типове данни.",
        "Не изисква нормализация или стандартизация на данните.",
        "Може да открива важни характеристики в dataset."
    ]

    weaknesses = [
        "Ако модела се обучава с прекалено много данни може да се получи свръхнапасване (overfitting).",
        "Често е по-малко точен от ансамблови методи като Random Forest.",
        "Малки промени в данните могат да доведат до различна структура на дървото.",
    ]

    applications = [
        "Прогнозиране на цени и стойности.",
        "Анализ на финансови данни.",
        "Системи за вземане на решения.",
        "Медицински анализи"
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)

