from modelInfo.model_info_show import model_info_show

def get_model_info_support_vector_regression():
    model_name = "Support Vector Regression (SVR)"
    description = [
        "Support Vector Regression (SVR) е регресионна версия на алгоритъма Support Vector Machine (SVM). "
        "Основната идея на модела е да намери функция, която описва връзката между входните данни и целевата стойност, като същевременно допуска малка грешка. "
        "Алгоритъмът се стреми да намери линия или крива, която най-добре приближава данните, но позволява на част от точките да бъдат в определена допустима зона на грешка. "
        "Моделът използва само част от данните, наречени support vectors, които са най-важните точки за определяне на модела. "
        "Освен това SVR може да използва kernel функции, които позволяват моделиране на сложни нелинейни зависимости между променливите. "
    ]

    image_name = "support_vector_regression"

    strengths = [
        "Работи добре при сложни и нелинейни зависимости.",
        "Подходящ за малки и средни набори от данни.",
        "Използва само най-важните точки.",
        "Може да бъде много точен при правилно избрани параметри.",
    ]

    weaknesses = [
        "Изисква внимателна настройка на параметрите.",
        "Може да бъде бавен при големи datasets.",
        "Чуствителен към избора на kernel функция.",
        "По-труден за интерпретация от по-прости модели."
    ]

    applications = [
        "Прогнозиране на финансови пазари.",
        "Анализ на времеви серии.",
        "Прогнозиране на продажби и търсене.",
        "Инженерни научни изследвания.",
        "Обработка на сложни нелинейни зависимости в данните."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)
