from modelInfo.model_info_show import model_info_show

def get_model_info_lasso_regression():
    model_name = "Lasso Regression"
    description = [
        "Lasso Regression е също разширение на линейната регресия, която използва L1 регуляризация, "
        "като добавя сумата от абсолютните стойности на теглата на модела към функцията за загуба, насърчавайки разредеността, като изтласква някои тегла точно до нула, тоест занулява коефицентите. "
        "Ласо регресията влияе директно върху компромиса между отклонението и дисперсията чрез своята сила на регуларизация  "
        "Без регуларизация, този модел може да се окаже прекалено напасващ, когато броят на предикторите е голям. "
        "Lasso не само намалява overfitting, но и избира най-важните характеристики, като премахва ненужните. "
    ]

    image_name = "lasso_regression"

    strengths = [
        "Подобрява стабилността, когато характеристиките се припокриват. ",
        "Работи добре когато има силна корелация между характеристиките (мултиколинеарност). ",
        "Помага на модела да се обобщава по-добре върху нови данни. ",
        "Намалява дисперсията и подобрява прогнозирането върху шумни набори от данни. ",
        "Запазва всички характеристики в модела, като само намалява техните коефиценти, вместо да премахва някоя от тях, за разлика от Lasso. "
    ]

    weaknesses = [
        "Интерпретацията на модела може да стане по-трудна при много характеристики. ",
        "Изисква внимателна λ (алфа) настройка за най-добра производителност. ",
        "Коефициентите се свиват, но никога не се редуцират до точната нула. ",
    ]

    applications = [
        "Прогнозиране на цени на имоти.",
        "Финансови модели.",
        "Иконометрични анализи.",
        "Прогнозиране на продажби.",
        "Анализ на данни с голям брой характеристики.",
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)