from modelInfo.model_info_show import model_info_show

def get_model_info_polynomial_regression():
    model_name = "Polynomial Regression"
    description = [
        "Полиномната регресия е форма или разширение на линейната регресия, която позволява моделиране на нелинейни зависимости между променливите. "
        "Вместо да използва само линейна връзка между входните характеристики и целева стойност, алгоритъмът добавя полиномиални членове. "
        "Това позволява на модела да описва по-сложни зависимости в данните, като същевременно остава базиран на линейната регресия по-отношение на параметрите. "
        "Степента на полинома определя колко сложна ще бъде кривата, която моделът използва за приближение на данните. "
    ]

    image_name = "polynomial_regression"

    strengths = [
        "Позволява моделиране на нелинейни зависимости.",
        "По-гъвкав от стандартната линейна регресия.",
        "Може значително да подобри точността при сложни зависимости.",
        "Лесна за имплементация.",
    ]

    weaknesses = [
        "При висока степен може да доведе до свръхнапасване (overfitting).",
        "Изисква внимателен избор за степента на полинома.",
        "При много характеристики може да увеличи силно размерността на данните.",
    ]

    applications = [
        "Прогнозиране на тенденции във времеви серии.",
        "Анализ на икономически и финансови данни.",
        "Моделиране на растеж или спад на стойности.",
        "Инженерни и научни изследвания."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)
