from modelInfo.model_info_show import model_info_show

def get_model_info_random_forest():
    model_name = "Random Forest"
    description = [
        "Random Forest е ансамблов алгоритъм за машинно обучение, който използва множество decision tree модели. "
        "Той комбинира резултатите от различните дървета, за да направи по-точна прогноза и да намали грешките. "
        "При изграждането на всяко дърво не се разглеждат всички характеристики едновременно, избират се на случаен принцип, за да се реши как да се разделят данните, като това помага на дърветата да остант различни едно от друго. "
        "Лесното използване и гъвкавостта му помагат да се използва със задачи за класификация и регресия. "
    ]

    image_name = "random_forest"

    strengths = [
        "Универсален, обработва големи масиви от входни данни с големи признаци с не линейни връзки.",
        "Използва се за задачи, както за класификация така и за регресия.",
        "Обработва липсващи стойности в данни.",
        "Намалява свръхнапасването (overfitting).",
        "Дава сравнително много висока точност.",
        "Не изисква нормализация или стандартизация на набора от данни.",
        "Добра производителност при голям брой характеристики."
    ]

    weaknesses = [
        "Не е подходящ за задачи в реално време.",
        "Труден за интерпретация.",
        "Може да бъде изчислително скъп при много голям брой дървета.",
    ]

    applications = [
        "Финансови прогнози.",
        "Медицинска диагностика.",
        "Прогнозиране на цени.",
        "Анализ на клиентско поведение.",
        "Рекламни препоръки."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)

