from modelInfo.model_info_show import model_info_show

def get_model_info_linear_regression():
    model_name = "Linear Regression"
    description = [
        "   Линейната регресия е дин от най-основните алгоритми за машинно обучение, използван за прогнозиране на числови стойности. "
        "Той намира линейна зависимост между входните променливи и изходната стойност, като изчислява права линия, която най-добре описва връзката между тях. "
    ]

    image_name = "linear_regression"

    strengths = [
        "Лесна интерпретация.",
        "Бърз за обучение и изчисление.",
        "Работи добре при ясно изразени линейни зависимост между променливите.",
        "Изисква малко изчислителни ресурси.",
    ]

    weaknesses = [
        "Работи добре само при линейна зависимост.",
        "Чувствителен към екстремни стойности.",
        "Може да даде неточни резултати при сложни и нелинейни данни."
    ]

    applications = [
        "Прогнозиране на цени на недвижими имоти.",
        "Финансови анализи.",
        "Икономически прогнози.",
        "Прогнози за търсене."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)
