from modelInfo.model_info_show import model_info_show

def get_model_info_ridge_regression():
    model_name = "Ridge Regression"
    description = [
        "Ridge Regression е разширение на линейната регресия, която използва L2 регуляризация, за да намали риска от свръхнапасване (overfitting). "
        "Линейната регресия минимизира само грешката в прогнозирането, но може да стане нестабилна, когато характеристиките са силно корелирани. "
        "Ridge Regression решава това чрез свиване на коефициентите, което прави модела по-стабилен и намалява пренареждането. "
    ]

    image_name = "ridge_regression"

    strengths = [
        "Подобрява стабилността, когато характеристиките се припокриват.",
        "Работи добре когато има силна корелация между характеристиките (мултиколинеарност).",
        "Помага на модела да се обобщава по-добре върху нови данни.",
        "Намалява дисперсията и подобрява прогнозирането върху шумни набори от данни.",
        "Запазва всички характеристики в модела, като само намалява техните коефиценти, вместо да премахва някоя от тях, за разлика от Lasso."
    ]

    weaknesses = [
        "Интерпретацията на модела може да стане по-трудна при много характеристики.",
        "Изисква внимателна λ (алфа) настройка за най-добра производителност.",
        "Коефициентите се свиват, но никога не се редуцират до точната нула.",
    ]

    applications = [
        "Прогнозиране на цени на имоти.",
        "Финансови модели.",
        "Иконометрични анализи.",
        "Прогнозиране на продажби.",
        "Анализ на данни с голям брой характеристики."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)
