from modelInfo.model_info_show import model_info_show

def get_model_info_gradient_boosting():
    model_name = "Gradient Boosting"
    description = [
        "Gradient Boosting Regression е мощен ансамблов алгоритъм за машинно обучение, който комбинира множество слаби модели (обикновено decision trees), за да създаде един по-точен модел. "
        "Във всяка итерация алгоритъмът изчислява градиента на функцията на загуба спрямо прогнозите и след това обучава нов слаб модел, за да предскаже този градиент. "
        "Прогнозите на новия модел се добавят към ансамбъла (прогноза на всички модели) и процесът се повтаря, докато не бъде изпълнен критерий за спиране. "
        "Всеки нов модел поправя грешките на предишния, като това става последователно, така постепенно се създава модел, който дава много точни прогнози. "
    ]

    image_name = "gradient_boosting"

    strengths = [
        "Много висока точност на предсказванията.",
        "Работи добре със сложни и нелинейни зависимости.",
        "Може да обработва различни типове данни.",
        "Един от най-ефективните алгоритми за таблични данни."
    ]

    weaknesses = [
        "Не е подходящ когато входните признаци са много на брой.",
        "Не е подходящ когато вземането на решение е критично.",
        "Не е подходящ за не структурирани входни данни.",
    ]

    applications = [
        "Прогнози на цени на имоти.",
        "Финансов анализ и прогнозиране.",
        "Оценка на кредитен риск.",
        "Системи за препоръки (реклами).",
        "Анализ на потребителско поведение."
    ]

    model_info_show(model_name, description, image_name, strengths, weaknesses, applications)

